# -*- coding: utf-8 -*-
# THIS FILE FOR OUR BOK TOKEN

token = '1605539790:AAHTvlJPSzHgkIALpWNFvAeuQE_xYSO6MGU'
z1 = 'Рыцарский турнир длится ровно 7 дней. К концу четвертого дня сэр Ланселот не успел сразиться лишь с ' \
     'одной четвертью от общего числа участников турнира. А сэр Тристан к этому времени сразился ровно с одной ' \
     'седьмой из тех рыцарей, ' \
     'с кем успел сразиться сэр Ланселот. Какое минимальное количество рыцарей могло участвовать в турнире?'
z2 = "Из 38 учащихся 28 посещают хор и 17 лыжную секцию. Сколько лыжников посещает хор, если в классе нет учащихся, " \
     "которые не посещают хор или лыжную секцию ?"
z3 = "Чтобы попасть на дачу семьи Соловьёвых надо сначала идти от станции 3 км по шоссе, а затем 2"\
    "км по тропинке. Приехав на станцию, мама позвонила на дачу сыну Васе и попросила встретить её"\
    "на велосипеде. Движение навстречу друг другу они начали одновременно. Мама всё время идёт с"\
    "постоянной скоростью 4 км/ч, а Вася по тропинке едет со скоростью 20 км/ч, а по шоссе со"\
    "скоростью 22 км/ч. На каком расстоянии от станции Вася встретил маму? Ответ дайте в метрах."
z4 = "В трех кучках лежат соответственно 12, 24 и 19 спичек.За ход можно переложить спичку из одной кучки в другую." \
     "За какое наименьшее число ходов можно получить три кучки с 8, 21 и 26 спичками? "
z5 = "На учебных стрельбах каждый из солдат стрелял по 10 раз. Один из них выполнил задание удачно и выбил 90 очков. " \
     "Сколько раз он выбил 9 очков, если десяток было 4, а результатами остальных " \
     "попаданий были семёрки, восьмёрки и девятки. При этом промахов не было ни одного."
z6 = "Среди целых чисел от 8 до 17 включительно зачеркните как можно меньше чисел так, чтобы произведение оставшихся " \
     "было точным квадратом. В ответе укажите сумму всех вычеркнутых чисел."
z7 = "На гранях кубика расставлены 6 различных чисел от 6 до 11. Кубик бросили два раза. В первый раз сумма чисел на " \
     "четырех боковых гранях оказалась равна 36, во второй — 33. Какое число написано на грани, противоположной той, " \
     "где написана цифра 10?"
z8 = "В конкурсе участвовали 5 человек. На каждый вопрос один из них дал неправильный ответ, остальные — правильный. " \
     "Число правильных ответов у Пети равно 10 — меньше, чем у любого другого. Число правильных ответов у Васи равно 13 — больше, " \
     "чем у любого другого.Сколько всего вопросов было в конкурсе?"
z9 = "Команда из Пети, Васи и одноместного самоката участвует в гонке. Дистанция разделена на участки одинаковой длины, их количество " \
     "равно 42, в начале каждого — контрольный пункт. Петя пробегает участок за 9 мин, Вася — за 11 мин, а на самокате любой из них " \
     "проезжает участок за 3 мин. Стартуют они одновременно, а на финише учитывается время того, кто пришел последним. Ребята " \
     "договорились, что один проезжает первую часть пути на самокате, остаток бегом, а другой — наоборот (самокат можно оставить " \
     "на любом контрольном пункте).Сколько участков Петя должен проехать на самокате, чтобы команда показала наилучшее время?"
z10 = "Мальчик пошел с отцом в тир. Отец купил ему 10 пулек. В дальнейшем отец за каждый промах отбирал у сына одну пульку, а за " \
      "каждое попадание давал одну дополнительную пульку. Сын выстрелил 55 раз, после чего пульки у него кончились. Сколько раз он попал? "
spisok = [z1,z2,z3,z4,z5,z6,z7,z8,z9,z10,20, 7, 800, 4, 3, 55, 8, 14, 18, 50]